Revit 2027 API
TextElement.GetMinimumAllowedWidth Method
 Returns the minimum width the text element can be assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetMinimumAllowedWidth()
Public Function GetMinimumAllowedWidth As Double
public:
double GetMinimumAllowedWidth()
member GetMinimumAllowedWidth : unit -> float
Return Value
Double
 The minimum allowed width in paper space [ft].
Remarks
 Note that it is not necessarily a constant; it can be affected by properties of the text and its type, such as the width factor.
See Also
Reference
TextElement Class
GetMinimumAllowedWidth Overload
Autodesk.Revit.DB Namespace